EntroMorphic/reflex-os/sdkconfig.defaults.independence
CONFIG_IDF_TARGET="esp32c6"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="4MB"
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"
CONFIG_ULP_COPROC_ENABLED=y
CONFIG_ULP_COPROC_TYPE_LP_CORE=y
CONFIG_ULP_COPROC_RESERVE_MEM=2048

CONFIG_REFLEX_KERNEL_SCHEDULER=y

# The independence path: the blob-free radio, which is what
# docs/independence-dependency-map.md and tools/check_independence.py both
# measure. It is not the default backend, so before this file existed the
# configuration every independence claim refers to had no build recipe.
CONFIG_REFLEX_RADIO_802154=y
